In [1]:
#PANDAS

In [2]:
#Installing and Using Pandas
import pandas
pandas.__version__

'1.0.5'

In [3]:
#panda objects
import numpy as np
import pandas as pd

In [4]:
#series
people=pd.Series([1232,4656,788,456,790])
people

0    1232
1    4656
2     788
3     456
4     790
dtype: int64

In [5]:
people.values

array([1232, 4656,  788,  456,  790], dtype=int64)

In [6]:
people.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
#Assigning meaningful labels to index.
Friends=pd.Series([1232,4656,788,456,790],
index=['nayana','tharu','vidhya','maha','jenni'])
Friends

nayana    1232
tharu     4656
vidhya     788
maha       456
jenni      790
dtype: int64

In [8]:
#refering values in Series
Friends['vidhya']

788

In [9]:
#indexing
Friends[1]

4656

In [10]:
Friends.name= 'counts'
Friends.index.name = 'phylum'
Friends

phylum
nayana    1232
tharu     4656
vidhya     788
maha       456
jenni      790
Name: counts, dtype: int64

In [11]:
#can use other operations
np.log(Friends)

phylum
nayana    7.116394
tharu     8.445912
vidhya    6.669498
maha      6.122493
jenni     6.672033
Name: counts, dtype: float64

In [12]:
#filter according to the values
Friends[Friends<500]

phylum
maha    456
Name: counts, dtype: int64

In [13]:
Friends_dict= {'tharu': 78, 'Arun': 67, 'asha': 89, 'pavan': 78}
print(Friends_dict)
pd.Series(Friends_dict)

{'tharu': 78, 'Arun': 67, 'asha': 89, 'pavan': 78}

tharu    78
Arun     67
asha     89
pavan    78
dtype: int64

In [14]:
#Data Frame
Exam = {"subjects": ["English", "Science", "physics", "chemistry", "Maths", "social"],
        "printed": [2015, 2016, 2017, 2018, 2019, 2020],
        "id": [11, 22, 33, 44, 55, 66]}
print(Exam)
Exam = pd.DataFrame(Exam)
Exam

{'subjects': ['English', 'Science', 'physics', 'chemistry', 'Maths', 'social'], 'printed': [2015, 2016, 2017, 2018, 2019, 2020], 'id': [11, 22, 33, 44, 55, 66]}

    subjects  printed  id
0    English     2015  11
1    Science     2016  22
2    physics     2017  33
3  chemistry     2018  44
4      Maths     2019  55
5     social     2020  66

In [15]:
#changing order of columns
ab=pd.DataFrame(Exam,columns=["printed","id","subjects"])
ab

   printed  id   subjects
0     2015  11    English
1     2016  22    Science
2     2017  33    physics
3     2018  44  chemistry
4     2019  55      Maths
5     2020  66     social

In [16]:
#Assigning values to new column
ab['released'] = ab.printed / ab.id
ab

   printed  id   subjects    released
0     2015  11    English  183.181818
1     2016  22    Science   91.636364
2     2017  33    physics   61.121212
3     2018  44  chemistry   45.863636
4     2019  55      Maths   36.709091
5     2020  66     social   30.606061

In [17]:
ab['result'] = pd.Series(range(7), index=[0, 1, 2, 3, 4, 5,6])
ab

   printed  id   subjects    released  result
0     2015  11    English  183.181818       0
1     2016  22    Science   91.636364       1
2     2017  33    physics   61.121212       2
3     2018  44  chemistry   45.863636       3
4     2019  55      Maths   36.709091       4
5     2020  66     social   30.606061       5

In [18]:
ab.to_dict()

{'printed': {0: 2015, 1: 2016, 2: 2017, 3: 2018, 4: 2019, 5: 2020},
 'id': {0: 11, 1: 22, 2: 33, 3: 44, 4: 55, 5: 66},
 'subjects': {0: 'English',
  1: 'Science',
  2: 'physics',
  3: 'chemistry',
  4: 'Maths',
  5: 'social'},
 'released': {0: 183.1818181818182,
  1: 91.63636363636364,
  2: 61.121212121212125,
  3: 45.86363636363637,
  4: 36.70909090909091,
  5: 30.606060606060606},
 'result': {0: 0, 1: 1, 2: 2, 3: 3, 4: 4, 5: 5}}

In [19]:
pd.DataFrame(ab.to_dict())

   printed  id   subjects    released  result
0     2015  11    English  183.181818       0
1     2016  22    Science   91.636364       1
2     2017  33    physics   61.121212       2
3     2018  44  chemistry   45.863636       3
4     2019  55      Maths   36.709091       4
5     2020  66     social   30.606061       5

In [20]:
#from a list of dicts
part = [{'n': i, 'm':5* i}for i in range(7)]
print(part)
pd.DataFrame(part)

[{'n': 0, 'm': 0}, {'n': 1, 'm': 5}, {'n': 2, 'm': 10}, {'n': 3, 'm': 15}, {'n': 4, 'm': 20}, {'n': 5, 'm': 25}, {'n': 6, 'm': 30}]

   n   m
0  0   0
1  1   5
2  2  10
3  3  15
4  4  20
5  5  25
6  6  30

In [21]:
#NAN
pd.DataFrame([{'ba': 7, 'ma': 8}, {'ca': 6, 'ah': 8}])

    ba   ma   ca   ah
0  7.0  8.0  NaN  NaN
1  NaN  NaN  6.0  8.0

In [22]:
#2d numpy array
pd.DataFrame(np.random.randint(8, 13),
             columns=['ART', 'Skill'],
             index=['x', 'y', 'z'])

   ART  Skill
x    8      8
y    8      8
z    8      8

In [23]:
#Index
kit = pd.Index([78, 90, 47, 67, 78])
kit

Int64Index([78, 90, 47, 67, 78], dtype='int64')

In [24]:
kit[3]

67

In [25]:
kit[3:5:]

Int64Index([67, 78], dtype='int64')

In [26]:
kit[::]

Int64Index([78, 90, 47, 67, 78], dtype='int64')

In [27]:
print(kit.size, kit.shape, kit.ndim, kit.dtype)

5 (5,) 1 int64

In [28]:
#index don't support mutable operations
kit[47]=0

TypeError: Index does not support mutable operations

In [29]:
#Operating on Data in Pandas
pad = np.random.RandomState(20)
air = pd.Series(pad.randint(1, 15, 3))
air

0     4
1    11
2    13
dtype: int32

In [30]:
bat = pd.DataFrame(pad.randint(1, 15, (5, 4)),
                  columns=['A', 'B', 'C', 'D'])
bat

    A   B  C   D
0  11  10  5  12
1   7   8  3   1
2   7   9  6  11
3  11  12  4   1
4  14   7  7   1

In [31]:
np.exp(air)

0        54.598150
1     59874.141715
2    442413.392009
dtype: float64

In [32]:
np.sin(bat * np.pi / 3)

          A             B             C             D
0 -0.866025 -8.660254e-01 -8.660254e-01 -4.898587e-16
1  0.866025  8.660254e-01  1.224647e-16  8.660254e-01
2  0.866025  3.673940e-16 -2.449294e-16 -8.660254e-01
3 -0.866025 -4.898587e-16 -8.660254e-01  8.660254e-01
4  0.866025  8.660254e-01  8.660254e-01  8.660254e-01

In [33]:
#Index alignment in Series
bike = pd.Series({'Honda': 8784, 'dio': 8997,
                  'ktm': 4567}, name='bike')
price = pd.Series({'hubli': 465477, 'goa': 235436456,
                        'mysore': 45436547}, name='price')
print(bike)
price

Honda    8784
dio      8997
ktm      4567
Name: bike, dtype: int64

hubli        465477
goa       235436456
mysore     45436547
Name: price, dtype: int64

In [34]:
bike/price

Honda    NaN
dio      NaN
goa      NaN
hubli    NaN
ktm      NaN
mysore   NaN
dtype: float64

In [35]:
bike.index|price.index

Index(['Honda', 'dio', 'goa', 'hubli', 'ktm', 'mysore'], dtype='object')

In [36]:
s = pd.Series([3, 5, 6], index=[0, 1, 2])
r = pd.Series([4, 2, 1], index=[0, 2, 3])
print(s)
print(r)
s + r

0    3
1    5
2    6
dtype: int64
0    4
2    2
3    1
dtype: int64

0    7.0
1    NaN
2    8.0
3    NaN
dtype: float64

In [37]:
s.add(r, fill_value=0)

0    7.0
1    5.0
2    8.0
3    1.0
dtype: float64

In [38]:
#Merge operations
ab

   printed  id   subjects    released  result
0     2015  11    English  183.181818       0
1     2016  22    Science   91.636364       1
2     2017  33    physics   61.121212       2
3     2018  44  chemistry   45.863636       3
4     2019  55      Maths   36.709091       4
5     2020  66     social   30.606061       5

In [39]:
order = pd.DataFrame({"subjects": ["social", "english", "physics"], "required": ["23", "23", "90"]})
order

  subjects required
0   social       23
1  english       23
2  physics       90

In [40]:
ab.merge(order)

   printed  id subjects   released  result required
0     2017  33  physics  61.121212       2       90
1     2020  66   social  30.606061       5       23

In [41]:
bc = pd.DataFrame({"subjects": ["physics", "maths"], "required": ["89", "39"]})
bc
ab.merge(bc, right_on='subjects', left_on='subjects')

   printed  id subjects   released  result required
0     2017  33  physics  61.121212       2       89

In [42]:
ca = pd.DataFrame({"subjects": ["maths", "social", "english"], "required": ["44", "33", "67"]})
ab.merge(ca, how='outer')

   printed    id   subjects    released  result required
0   2015.0  11.0    English  183.181818     0.0      NaN
1   2016.0  22.0    Science   91.636364     1.0      NaN
2   2017.0  33.0    physics   61.121212     2.0      NaN
3   2018.0  44.0  chemistry   45.863636     3.0      NaN
4   2019.0  55.0      Maths   36.709091     4.0      NaN
5   2020.0  66.0     social   30.606061     5.0       33
6      NaN   NaN      maths         NaN     NaN       44
7      NaN   NaN    english         NaN     NaN       67

In [43]:
da = pd.DataFrame({"subjects": ["maths", "social", "english"], "required": ["99", "49", "65"]})
print(ab)
ab.merge(da, how='outer')

   printed  id   subjects    released  result
0     2015  11    English  183.181818       0
1     2016  22    Science   91.636364       1
2     2017  33    physics   61.121212       2
3     2018  44  chemistry   45.863636       3
4     2019  55      Maths   36.709091       4
5     2020  66     social   30.606061       5

   printed    id   subjects    released  result required
0   2015.0  11.0    English  183.181818     0.0      NaN
1   2016.0  22.0    Science   91.636364     1.0      NaN
2   2017.0  33.0    physics   61.121212     2.0      NaN
3   2018.0  44.0  chemistry   45.863636     3.0      NaN
4   2019.0  55.0      Maths   36.709091     4.0      NaN
5   2020.0  66.0     social   30.606061     5.0       49
6      NaN   NaN      maths         NaN     NaN       99
7      NaN   NaN    english         NaN     NaN       65

In [44]:
#Combining data with overlap
park = pd.Series(['dog', 2.5, 8.6, 'cow', 4.5, np.nan, np.nan, np.nan],
                     index=['1', '2', '3', '4', '5', '6', '7', '8'])
bark = pd.Series(np.arange(len(park), dtype=np.float64),
                 index=['1', '2', '3', '4', '5', '6', '7', '8'])

In [45]:
park

1    dog
2    2.5
3    8.6
4    cow
5    4.5
6    NaN
7    NaN
8    NaN
dtype: object

In [46]:
bark

1    0.0
2    1.0
3    2.0
4    3.0
5    4.0
6    5.0
7    6.0
8    7.0
dtype: float64

In [47]:
pd.Series(np.where(pd.isnull(park), bark, park), index=park.index)

1    dog
2    2.5
3    8.6
4    cow
5    4.5
6      5
7      6
8      7
dtype: object

In [48]:
#simple way
park.combine_first(bark)

1    dog
2    2.5
3    8.6
4    cow
5    4.5
6      5
7      6
8      7
dtype: object